lab11_ci4/ci4/app/Controllers/Artikel.php


        $kategoriModel = new KategoriModel();
        $title = "Tambah Artikel";
        $kategori = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';

        // TAMBAHAN MODUL 9: Tangkap parameter 'page' untuk pagination AJAX
        $page = $this->request->getVar('page') ?? 1;

        $model = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $builder = $model->select('artikel.*, kategori.nama_kategori')
                         ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        if ($q != '') {
            $builder->like('artikel.judul', $q);
        }
        if ($kategori_id != '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $data = [
            'title'       => $title,
            'q'           => $q,
            'kategori_id' => $kategori_id,
            // TAMBAHAN MODUL 9: Masukkan $page ke dalam fungsi paginate
            'artikel'     => $builder->orderBy('artikel.id', 'ASC')->paginate(10, 'default', $page),
            'pager'       => $model->pager,
            'kategori'    => $kategoriModel->findAll()
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%artikel baru%' ESCAPE '!'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%artikel baru%' ESCAPE '!'
ORDER BY `artikel`.`id` ASC
 LIMIT 10
SELECT *
FROM `kategori`