lab11_ci4/ci4/app/Controllers/Post.php

    public function index()
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC

    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul'  => $this->request->getVar('judul'),
            'isi'    => $this->request->getVar('isi'),
            'status' => $this->request->getVar('status')
        ];

        $model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`, `status`) VALUES ('artikel apa aja', 'isinya ya gitu dah', 1)